Simulaciones/Sim5/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wallz
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    inlet1
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    outlet1
    {
        type            fixedValue;
        value           uniform 0;
    } 

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
	value		uniform 0;
    }

    FrontBackPlanes
    {
        type            symmetry;
    }
}

// ************************************************************************* //
